app/controllers/appointments_controller.rb

    def create
      doctor = Doctor.find(params[:doctor_id])
       # Check if the doctor exists
      unless doctor
        render json: { error: 'Doctor not found.' }, status: :not_found
        return
      end
        if doctor.available_at?(params[:doctor_id], params[:appointment][:date], params[:appointment][:start_time], params[:appointment][:end_time])
            appointment = Appointment.new(appointment_params)
            appointment.doctor_id = params[:doctor_id]
            if appointment.save!
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "appointments" ("doctor_id", "date", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["doctor_id", 2], ["date", "2023-09-10"], ["start_time", "12:00:00"], ["end_time", "13:00:00"], ["created_at", "2023-09-08 18:26:25.529342"], ["updated_at", "2023-09-08 18:26:25.529342"]]

    def update
      appointment = Appointment.where(id: params[:id]).first
      #validate if an appointment exists
        unless appointment
            render json: { error: 'Appointment not found.' }, status: :not_found
            return
        end
        #validate if the doctor is available at the requested time
        doctor = Doctor.find(params[:doctor_id])
        unless doctor.available_at?(params[:doctor_id], params[:appointment][:date], params[:appointment][:start_time], params[:appointment][:end_time])
            render json: { error: 'Doctor is not available at the requested time.' }, status: :unprocessable_entity
            return
        end
        #update the appointment
        if appointment.update(appointment_params)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 ORDER BY "appointments"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "appointments" SET "date" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["date", "2023-11-01"], ["updated_at", "2023-09-08 12:24:16.624292"], ["id", 1]]

    def destroy
      appointment = Appointment.where(id: params[:id]).first
      doctor = Doctor.find(params[:doctor_id])
       #verify if the doctor exists
        unless doctor
            render json: { error: 'Doctor not found.' }, status: :not_found
            return
        end
       #verify if the appointment exists
        unless appointment
            render json: { error: 'Appointment not found.' }, status: :not_found
            return
        end
      appointment.destroy
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 1]]

    def set_doctor
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]