app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("doctor_id", "date", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["doctor_id", 2], ["date", "2023-09-01"], ["start_time", "10:00:00"], ["end_time", "11:00:00"], ["created_at", "2023-09-07 17:27:42.977997"], ["updated_at", "2023-09-07 17:27:42.977997"]]
---
    def create
      doctor = Doctor.find(params[:doctor_id])
       # Check if the doctor exists
      unless doctor
        render json: { error: 'Doctor not found.' }, status: :not_found
        return
      end
        if doctor.available_at?(params[:doctor_id], params[:appointment][:date], params[:appointment][:start_time], params[:appointment][:end_time])
            appointment = Appointment.new(appointment_params)
            appointment.doctor_id = params[:doctor_id]
            if appointment.save!

UPDATE "appointments" SET "date" = $1, "start_time" = $2, "end_time" = $3, "updated_at" = $4 WHERE "appointments"."id" = $5  [["date", "2023-10-01"], ["start_time", "15:00:00"], ["end_time", "16:00:00"], ["updated_at", "2023-09-08 12:22:25.592999"], ["id", 1]]
---
    def update
      appointment = Appointment.find(params[:id])
      #validate if an appointment exists
        unless appointment
            render json: { error: 'Appointment not found.' }, status: :not_found
            return
        end
        #validate if the doctor is available at the requested time
        doctor = Doctor.find(params[:doctor_id])
        unless doctor.available_at?(params[:doctor_id], params[:appointment][:date], params[:appointment][:start_time], params[:appointment][:end_time])
            render json: { error: 'Doctor is not available at the requested time.' }, status: :unprocessable_entity
            return
        end
        #update the appointment
        if appointment.update(appointment_params)