app/controllers/availabilities_controller.rb

SELECT "appointments"."start_time", "appointments"."end_time" FROM "appointments" WHERE "appointments"."doctor_id" = $1  [["doctor_id", 1]]
---
    def index
      doctor = Doctor.find(params[:doctor_id])

      general_hours = doctor.availabilities
      booked_times = doctor.appointments.pluck(:start_time, :end_time).flatten

      free_slots = general_hours.reject do |slot|
        booked_times.any? { |time| time >= slot.start_time && time <= slot.end_time }