app/controllers/availabilities_controller.rb

    def index
      doctor = Doctor.find(params[:doctor_id])

      # Check the doctor's general availabilities
      general_availabilities = doctor.availabilities
      if general_availabilities.empty?
        render json: { message: "This doctor has no available times" }, status: :not_found
        return
      end

      # Group booked times by day for the doctor
      booked_slots_by_day = {}
      doctor.appointments.each do |appointment|
        weekday = appointment.date.strftime('%A').upcase
        booked_slots_by_day[weekday] ||= []
        booked_slots_by_day[weekday] << [appointment.start_time, appointment.end_time]
      end

      # Calculate the free slots
      free_slots_by_day = {}
      general_availabilities.each do |availability|
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "availabilities" WHERE "availabilities"."doctor_id" = $1 LIMIT $2  [["doctor_id", 2], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = $1  [["doctor_id", 2]]
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."doctor_id" = $1  [["doctor_id", 2]]