app/controllers/availabilities_controller.rb

    def index
      doctor = Doctor.find(params[:id])
      #check the date requeste has available times or working hours
      general_availabilities = doctor.availabilities
      if general_availabilities.nil?
        render json: { message: "This doctor has no available times" }, status: :not_found
        return
      end
      # booked times for the doctor
      booked_slots_by_day = {}
      doctor.appointments.each do |appointment|
        weekday = appointment.date.strftime('%A').upcase
        booked_slots_by_day[weekday] ||= []
        booked_slots_by_day[weekday] << [appointment.start_time, appointment.end_time]
      end
      # calculate the free slots
      free_slots_by_day = {}
      general_availabilities.each do |availability|
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "doctors".* FROM "doctors"
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = $1  [["doctor_id", 2]]
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."doctor_id" = $1  [["doctor_id", 2]]