app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors"
---
    def index
        @doctors = Doctor.all