app/controllers/doctors_controller.rb

    def show
      doctor = Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def working_hours
        doctor = Doctor.find(params[:id])
        days_off = doctor.availabilities.pluck(:off_day).compact.uniq

            # Mapea las disponibilidades para obtener solo los horarios
        working_hours = doctor.availabilities.map do |availability|
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "availabilities"."off_day" FROM "availabilities" WHERE "availabilities"."doctor_id" = $1  [["doctor_id", 1]]
SELECT "doctors".* FROM "doctors"
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."doctor_id" = $1  [["doctor_id", 1]]