app/models/doctor.rb

    def available_at?(doctor_id, date, start_time, end_time)
        appointments = Appointment.where(doctor_id: doctor_id)
        date_object = Date.parse(date)
        weekday = date_object.strftime('%A').upcase
        requested_start_time = start_time
        requested_end_time = end_time
        # Verify that the requested time range is valid
        return false if requested_start_time >= requested_end_time
        availability = Availability.find_by(doctor_id: doctor_id, weekday: weekday)
        # Verify that the requested date is a laborable date for the doctor
        return false if availability.nil?

        # Search if the doctor already has an appointment in the requested time range
        overlapping_appointments = appointments.where(date: date).where("(start_time <= ? AND end_time > ?) OR (start_time < ? AND end_time >= ?) OR (start_time >= ? AND end_time <= ?)", requested_start_time, requested_start_time, requested_end_time, requested_end_time, requested_start_time, requested_end_time)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = $1  [["doctor_id", 2023]]
SELECT "availabilities".* FROM "availabilities" WHERE "availabilities"."doctor_id" = $1 AND "availabilities"."weekday" = $2 LIMIT $3  [["doctor_id", 1], ["weekday", "THURSDAY"], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = $1 AND "appointments"."date" = $2 AND ((start_time <= '10:00' AND end_time > '10:00') OR (start_time < '11:00' AND end_time >= '11:00') OR (start_time >= '10:00' AND end_time <= '11:00'))  [["doctor_id", 2], ["date", "2023-09-01"]]